1-Start here (blogpost)/blogpost/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Post two"], ["body", "body"], ["created_at", "2020-07-10 16:07:10.572847"], ["updated_at", "2020-07-10 16:07:10.572847"]]